In [1]:
import pandas as pd
import datetime

In [2]:
data = pd.read_csv("moxy_data.csv", header=2)

In [11]:
data.head()

  mm-dd hh:mm:ss  SmO2 Live  SmO2 Averaged    THb  Lap  Session Ct  Unnamed: 7
0  12-3  13:21:0         42             42  13.00   11          28         NaN
1  12-3  13:21:0         42             42  12.99   11          28         NaN
2  12-3  13:21:1         43             43  13.03   11          28         NaN
3  12-3  13:21:1         42             42  13.06   11          28         NaN
4  12-3  13:21:2         44             44  13.02   11          28         NaN

In [14]:
data["mm-dd"][0] + "-" + data["hh:mm:ss"][0]

'12-3-13:21:0'

In [16]:
pd.to_datetime(data["mm-dd"][0] + "-" + data["hh:mm:ss"][0], format="%m-%d-%H:%M:%S")

Timestamp('1900-12-03 13:21:00')

In [3]:
today = datetime.date.today()
year = today.year
data["Date"] = pd.to_datetime(
    str(year) + "-" + data["mm-dd"] + "-" + data["hh:mm:ss"], format="%Y-%m-%d-%H:%M:%S")

In [4]:
data["Date"]

0      2023-12-03 13:21:00
1      2023-12-03 13:21:00
2      2023-12-03 13:21:01
3      2023-12-03 13:21:01
4      2023-12-03 13:21:02
               ...
9994   2023-12-13 15:02:48
9995   2023-12-13 15:02:49
9996   2023-12-13 15:02:50
9997   2023-12-13 15:02:51
9998   2023-12-13 15:02:52
Name: Date, Length: 9999, dtype: datetime64[ns]

In [10]:
data["Session Ct"].unique()

array([28, 29, 30, 31], dtype=int64)

In [11]:
data.index

RangeIndex(start=0, stop=9999, step=1)

In [13]:
date = "2023-12-03 13:40:20"
filtered_df = data.query("Date == @date")

In [14]:
filtered_df

,mm-dd,hh:mm:ss,SmO2 Live,SmO2 Averaged,THb,Lap,Session Ct,Unnamed: 7,Date
2320,12-3,13:40:20,55,55,12.96,11,28,NaN,2023-12-03 13:40:20
2321,12-3,13:40:20,54,54,12.92,11,28,NaN,2023-12-03 13:40:20